README.org
#+title: Resume Toolkit - JSONresume/BibTeX to HTML/PDF

This project provides a reusable build pipeline for generating:
- Resume HTML (from JSON Resume, using a customized version of [[https://github.com/rbardini/jsonresume-theme-even][jsonresume-theme-even]])
- Resume PDF (from Typst generated from JSON Resume and using the [[https://typst.app/universe/package/brilliant-cv][brilliant-cv]] Typst template)
- Publications HTML (from BibTeX)
- Publications PDF (from LaTeX/BibTeX, using [[https://github.com/posquit0/Awesome-CV][AwesomeCV]], so it looks the same as the resume PDF)
- Aggregated publications BibTeX

The recommended interface is the wrapper script =build-resume.sh=, which runs everything inside a Docker image.

* Quick Start

Build a Resume + publications:

#+begin_src sh
./build-resume.sh resume.json pubs-src/publications.bib
#+end_src

Build, watch changes, and serve output:

#+begin_src sh
./build-resume.sh resume.json pubs-src/publications.bib --watch --serve
#+end_src

Then open:
- =http://localhost:8080=

* Requirements

- Docker
- A JSON Resume file
- Optional BibTeX file(s) for publications

If no BibTeX files are provided, the publications output is skipped.

* Output Layout

Default output base directory:
- =build/<resume-stem>/=

Generated files:
- =build/<resume-stem>/vita/index.html=
- =build/<resume-stem>/vita/<resume-stem>.typ=
- =build/<resume-stem>/vita/<resume-stem>.pdf=
- =build/<resume-stem>/vita/publications/index.html= (if BibTeX provided)
- =build/<resume-stem>/vita/publications/<resume-stem>-pubs.pdf= (if BibTeX provided)
- =build/<resume-stem>/vita/publications/<resume-stem>-pubs.bib= (if BibTeX provided)

* Main Commands

** =build= (default)

These are equivalent:

#+begin_src sh
./build-resume.sh build resume.json pubs-src/publications.bib
./build-resume.sh resume.json pubs-src/publications.bib
#+end_src

Options:
- =--out <dir>=: output base directory
- =--pubs-url <url>=: online publications URL for PDF footer
- =--watch=: rebuild on input changes
- =--serve=: start HTTP server (implies =--watch=)

** =fetch-logos=

Download company/institution logos from the resume file into =assets/logos/= in your working directory. Once these files are available, the =build= step will include them automatically in the generated PDF. You can also provide/update the images by hand with the appropriate name.

#+begin_src sh
./build-resume.sh fetch-logos resume.json --overwrite
#+end_src

Options:
- =--overwrite=
- =--dry-run=
- =--token <token>= (or set =LOGODEV_TOKEN=)

** =update-certs=

Sync certificates from Credly into your JSON resume. This replaces any entries in the =certificates= section of the JSONresume file that have a =url= field pointing to =credly.com=. Other entries are left untouched.

#+begin_src sh
./build-resume.sh update-certs <credly-username> resume.json
#+end_src

Options:
- =--include-expired=
- =--include-non-cert-badges=
- =--sort <date_desc|date_asc|name>=

** =update-pub-numbers=

Update publication reference numbers in your JSON resume using the generated publications HTML anchors.

#+begin_src sh
./build-resume.sh update-pub-numbers resume.json
#+end_src

Options:
- =--html <path>= (defaults to =build/<resume-stem>/vita/publications/index.html=)

** Other passthrough subcommands

You can also call container entrypoint commands directly, for example:

#+begin_src sh
./build-resume.sh tasks
./build-resume.sh shell
#+end_src

=tasks= lists the =mise= tasks available inside the container (you can add =--hidden= to see internal tasks), and =shell= gives you an interactive shell inside the container.

* Environment Variables

- =VITA_PIPELINE_IMAGE=: Docker image (default: =zzamboni/vita-pipeline:latest=)
- =VITA_SERVE_PORT=: serve port (default: =8080=)
- =VITA_PIPELINE_CACHE_DIR=: host cache dir for container caches
- =LOGODEV_TOKEN=: token used by =fetch-logos=

* Automated Tests

Container integration tests live under =tests/container/= and validate:
- exposed task list
- end-to-end build outputs
- logo-fetch command wiring

Run tests:

#+begin_src sh
tests/container/test_container.sh
#+end_src

Optionally test a specific image:

#+begin_src sh
tests/container/test_container.sh myorg/vita-pipeline:latest
#+end_src

Or via mise:

#+begin_src sh
mise run test-container
#+end_src

* Under the Hood

The wrapper runs:
- containerized entrypoint in =docker/entrypoint.sh=
- pipeline script =scripts/run_pipeline.sh=
- supporting converters in =scripts/=

The repository includes =themes/jsonresume-theme-even= as a git submodule.
Clone with submodules enabled:

#+begin_src sh
git clone --recurse-submodules https://github.com/zzamboni/resume-toolkit.git
#+end_src

If you already cloned without submodules:

#+begin_src sh
git submodule update --init --recursive
#+end_src

The `mise` tasks are intentionally minimal and user-facing:
- =build=
- =fetch-logos=
- =update-certs=
